Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyIsCorruptWarning Property
 Some families have become unusable. Reload the families, or delete them from the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyIsCorruptWarning { get; }
Public Shared ReadOnly Property FamilyIsCorruptWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyIsCorruptWarning {
	FailureDefinitionId^ get ();
}
static member FamilyIsCorruptWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace